Revit 2024 API
Definition Properties
The Definition type exposes the following members.
Properties
Name | Description
Name
The user visible name for the parameter.
ParameterGroup |  Obsolete.
 Returns the group ID of the parameter definition.
See Also
Definition Class
Autodesk.Revit.DB Namespace